t21/Walnut_X/Packages/.cache/Keil.EFM32GGxxx_DFP.2.3.0.pdsc
        <!-- *************************  Device 'EFM32GG995F512'  ***************************** -->
        <device Dname="EFM32GG995F512">
          <processor Dclock="48000000"/>
          <compile header="Device/EFM32GG/Include/em_device.h"  define="EFM32GG995F512"/>
          <debug svd="SVD/EFM32GG/EFM32GG995F512.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32GG.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32GG990'  **************************** -->
      <subFamily DsubFamily="EFM32GG990">
        <feature type="LCD"           n="1"                           name="Integrated LCD Controller for up to 8x {36|34|20|18|16} segments"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="87"                          name="General Purpose I/O pins"/>

        <book name="Documents/EFM32GG990.pdf"                title="EFM32GG990 Data Sheet"/>
        <book name="Documents/EFM32GG990-errata.pdf"         title="EFM32GG990 Errata, Chip rev. D"/>
        <book name="Documents/efm32gg990-errata-history.pdf" title="EFM32GG990 Errata History"/>

        <!-- *************************  Device 'EFM32GG990F1024'  ***************************** -->
        <device Dname="EFM32GG990F1024">
          <processor Dclock="48000000"/>
          <compile header="Device/EFM32GG/Include/em_device.h"  define="EFM32GG990F1024"/>
          <debug svd="SVD/EFM32GG/EFM32GG990F1024.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32GG.FLM" start="0x00000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
        </device>

        <!-- *************************  Device 'EFM32GG990F512'  ***************************** -->
        <device Dname="EFM32GG990F512">
          <processor Dclock="48000000"/>
          <compile header="Device/EFM32GG/Include/em_device.h"  define="EFM32GG990F512"/>
          <debug svd="SVD/EFM32GG/EFM32GG990F512.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32GG.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32GG980'  **************************** -->
      <subFamily DsubFamily="EFM32GG980">
        <feature type="LCD"           n="1"                           name="Integrated LCD Controller for up to 8x {36|34|20|18|16} segments"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="83"                          name="General Purpose I/O pins"/>

        <book name="Documents/EFM32GG980.pdf"                title="EFM32GG980 Data Sheet"/>
        <book name="Documents/EFM32GG980-errata.pdf"         title="EFM32GG980 Errata, Chip rev. D"/>
        <book name="Documents/efm32gg980-errata-history.pdf" title="EFM32GG980 Errata History"/>

        <!-- *************************  Device 'EFM32GG980F1024'  ***************************** -->
        <device Dname="EFM32GG980F1024">
          <processor Dclock="48000000"/>
          <compile header="Device/EFM32GG/Include/em_device.h"  define="EFM32GG980F1024"/>
          <debug svd="SVD/EFM32GG/EFM32GG980F1024.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32GG.FLM" start="0x00000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
        </device>

        <!-- *************************  Device 'EFM32GG980F512'  ***************************** -->
        <device Dname="EFM32GG980F512">
          <processor Dclock="48000000"/>
          <compile header="Device/EFM32GG/Include/em_device.h"  define="EFM32GG980F512"/>
          <debug svd="SVD/EFM32GG/EFM32GG980F512.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32GG.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32GG942'  **************************** -->
      <subFamily DsubFamily="EFM32GG942">
        <feature type="LCD"           n="1"                           name="Integrated LCD Controller for up to 8x {36|34|20|18|16} segments"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="50"                          name="General Purpose I/O pins"/>

        <book name="Documents/EFM32GG942.pdf"                title="EFM32GG942 Data Sheet"/>
        <book name="Documents/EFM32GG942-errata.pdf"         title="EFM32GG942 Errata, Chip rev. D"/>
        <book name="Documents/efm32gg942-errata-history.pdf" title="EFM32GG942 Errata History"/>

        <!-- *************************  Device 'EFM32GG942F1024'  ***************************** -->
        <device Dname="EFM32GG942F1024">
          <processor Dclock="48000000"/>
          <compile header="Device/EFM32GG/Include/em_device.h"  define="EFM32GG942F1024"/>
          <debug svd="SVD/EFM32GG/EFM32GG942F1024.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32GG.FLM" start="0x00000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
        </device>

        <!-- *************************  Device 'EFM32GG942F512'  ***************************** -->
        <device Dname="EFM32GG942F512">
          <processor Dclock="48000000"/>
          <compile header="Device/EFM32GG/Include/em_device.h"  define="EFM32GG942F512"/>
          <debug svd="SVD/EFM32GG/EFM32GG942F512.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32GG.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32GG940'  **************************** -->
      <subFamily DsubFamily="EFM32GG940">
        <feature type="LCD"           n="1"                           name="Integrated LCD Controller for up to 8x {36|34|20|18|16} segments"/>
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="53"                          name="General Purpose I/O pins"/>

