t21/Walnut_X/Packages/.cache/Keil.EFM32GGxxx_DFP.2.3.0.pdsc
        <book name="Documents/EFM32GG395.pdf"                title="EFM32GG395 Data Sheet"/>
        <book name="Documents/EFM32GG395-errata.pdf"         title="EFM32GG395 Errata, Chip rev. D"/>
        <book name="Documents/efm32gg395-errata-history.pdf" title="EFM32GG395 Errata History"/>

        <!-- *************************  Device 'EFM32GG395F1024'  ***************************** -->
        <device Dname="EFM32GG395F1024">
          <processor Dclock="48000000"/>
          <compile header="Device/EFM32GG/Include/em_device.h"  define="EFM32GG395F1024"/>
          <debug svd="SVD/EFM32GG/EFM32GG395F1024.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32GG.FLM" start="0x00000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
        </device>

        <!-- *************************  Device 'EFM32GG395F512'  ***************************** -->
        <device Dname="EFM32GG395F512">
          <processor Dclock="48000000"/>
          <compile header="Device/EFM32GG/Include/em_device.h"  define="EFM32GG395F512"/>
          <debug svd="SVD/EFM32GG/EFM32GG395F512.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32GG.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32GG390'  **************************** -->
      <subFamily DsubFamily="EFM32GG390">
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="87"                          name="General Purpose I/O pins"/>

        <book name="Documents/EFM32GG390.pdf"                title="EFM32GG390 Data Sheet"/>
        <book name="Documents/EFM32GG390-errata.pdf"         title="EFM32GG390 Errata, Chip rev. D"/>
        <book name="Documents/efm32gg390-errata-history.pdf" title="EFM32GG390 Errata History"/>

        <!-- *************************  Device 'EFM32GG390F1024'  ***************************** -->
        <device Dname="EFM32GG390F1024">
          <processor Dclock="48000000"/>
          <compile header="Device/EFM32GG/Include/em_device.h"  define="EFM32GG390F1024"/>
          <debug svd="SVD/EFM32GG/EFM32GG390F1024.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32GG.FLM" start="0x00000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
        </device>

        <!-- *************************  Device 'EFM32GG390F512'  ***************************** -->
        <device Dname="EFM32GG390F512">
          <processor Dclock="48000000"/>
          <compile header="Device/EFM32GG/Include/em_device.h"  define="EFM32GG390F512"/>
          <debug svd="SVD/EFM32GG/EFM32GG390F512.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32GG.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32GG380'  **************************** -->
      <subFamily DsubFamily="EFM32GG380">
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="83"                          name="General Purpose I/O pins"/>

        <book name="Documents/EFM32GG380.pdf"                title="EFM32GG380 Data Sheet"/>
        <book name="Documents/EFM32GG380-errata.pdf"         title="EFM32GG380 Errata, Chip rev. D"/>
        <book name="Documents/efm32gg380-errata-history.pdf" title="EFM32GG380 Errata History"/>

        <!-- *************************  Device 'EFM32GG380F1024'  ***************************** -->
        <device Dname="EFM32GG380F1024">
          <processor Dclock="48000000"/>
          <compile header="Device/EFM32GG/Include/em_device.h"  define="EFM32GG380F1024"/>
          <debug svd="SVD/EFM32GG/EFM32GG380F1024.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00100000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32GG.FLM" start="0x00000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
        </device>

        <!-- *************************  Device 'EFM32GG380F512'  ***************************** -->
        <device Dname="EFM32GG380F512">
          <processor Dclock="48000000"/>
          <compile header="Device/EFM32GG/Include/em_device.h"  define="EFM32GG380F512"/>
          <debug svd="SVD/EFM32GG/EFM32GG380F512.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00020000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32GG.FLM" start="0x00000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32GG332'  **************************** -->
      <subFamily DsubFamily="EFM32GG332">
        <feature type="USBD"          n="1"/>
        <feature type="IOs"           n="50"                          name="General Purpose I/O pins"/>

