t21/Walnut_X/Packages/.cache/Keil.EFM32GGxxx_DFP.2.3.0.pdsc
    <component Cclass="Device" Cgroup="emlib" Csub="VCMP"      Cversion="4.2.1" condition="emlib Framework">
      <description>Voltage Comparator (VCMP) Peripheral API</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_VCMP
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__VCMP.html"/>
        <file category="header"  name="emlib/inc/em_vcmp.h"/>
        <file category="source"  name="emlib/src/em_vcmp.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emlib" Csub="WDOG"      Cversion="4.2.1" condition="emlib Framework">
      <description>Watchdog (WDOG) Peripheral API</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMLIB_WDOG
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__WDOG.html"/>
        <file category="header"  name="emlib/inc/em_wdog.h"/>
        <file category="source"  name="emlib/src/em_wdog.c"/>
      </files>
    </component>

    <!-- emdrv -->
    <component Cclass="Device" Cgroup="emdrv" Csub="DMADRV"   Cversion="4.2.1" condition="emdrv DMADRV">
      <description>DMADRV Direct Memory Access Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_DMADRV
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__DMADRV.html"/>
        <file category="include" name="emdrv/common/inc/"/>
        <file category="header"  name="emdrv/dmadrv/inc/dmadrv.h"/>
        <file category="source"  name="emdrv/dmadrv/src/dmadrv.c"/>
        <file category="header"  name="emdrv/config/dmadrv_config.h" attr="config" version="4.2.1"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emdrv" Csub="GPIOINT"   Cversion="4.2.1" condition="emdrv GPIOINT">
      <description>General Purpose Input/Output Interrupt dispatcher</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_GPIOINT
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__GPIOINT.html"/>
        <file category="include" name="emdrv/common/inc/"/>
        <file category="header"  name="emdrv/gpiointerrupt/inc/gpiointerrupt.h"/>
        <file category="source"  name="emdrv/gpiointerrupt/src/gpiointerrupt.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emdrv" Csub="NVM"       Cversion="4.2.1" condition="emdrv NVM">
      <description>Non-volatile Memory Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_NVM
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__NVM.html"/>
        <file category="include" name="emdrv/common/inc/"/>
        <file category="header"  name="emdrv/config/nvm_config.h" attr="config" version="3.20.0"/>
        <file category="source"  name="emdrv/config/nvm_config.c"/>
        <file category="header"  name="emdrv/nvm/inc/nvm.h"/>
        <file category="source"  name="emdrv/nvm/src/nvm.c"/>
        <file category="source"  name="emdrv/nvm/src/nvm_hal.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emdrv" Csub="RTCDRV"    Cversion="4.2.1" condition="emdrv RTCDRV">
      <description>Real Time Clock Timer Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_RTCDRV
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__RTCDRV.html"/>
        <file category="include" name="emdrv/common/inc/"/>
        <file category="header"  name="emdrv/config/rtcdrv_config.h" attr="config" version="3.20.0"/>
        <file category="header"  name="emdrv/rtcdrv/inc/rtcdriver.h"/>
        <file category="source"  name="emdrv/rtcdrv/src/rtcdriver.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emdrv" Csub="SLEEP"     Cversion="4.2.1" condition="emdrv SLEEP">
      <description>Sleep Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_SLEEP
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__SLEEP.html"/>
        <file category="include" name="emdrv/common/inc/"/>
        <file category="header"  name="emdrv/sleep/inc/sleep.h"/>
        <file category="source"  name="emdrv/sleep/src/sleep.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="emdrv" Csub="SPIDRV"    Cversion="4.2.1" condition="emdrv SPIDRV">
      <description>Serial Peripheral Interface Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_SPIDRV
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__SPIDRV.html"/>
        <file category="include" name="emdrv/common/inc/"/>
        <file category="header"  name="emdrv/config/spidrv_config.h" attr="config" version="3.20.0"/>
        <file category="header"  name="emdrv/spidrv/inc/spidrv.h"/>
        <file category="source"  name="emdrv/spidrv/src/spidrv.c"/>
      </files>
    </component>
    <!-- (does not compile ) component Cclass="Device" Cgroup="emdrv" Csub="TEMPDRV"    Cversion="4.2.1" condition="emdrv TEMPDRV">
      <description>Temperature Sensor Interface Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_EMDRV_TEMPDRV
      </RTE_Components_h>
      <files>
        <file category="doc"     name="emdoc/efm32gg/html/group__TEMPDRV.html"/>
        <file category="include" name="emdrv/common/inc/"/>
        <file category="header"  name="emdrv/config/tempdrv_config.h" attr="config" version="3.20.0"/>
        <file category="header"  name="emdrv/tempdrv/inc/tempdrv.h"/>
        <file category="source"  name="emdrv/tempdrv/src/tempdrv.c"/>
      </files>
    </component-->

    <component Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.1" Cversion="2.1" condition="EFM32GG CMSIS GPIO CMU DMA">
      <description>SPI (USART in SPI mode) Driver for EFM32GG Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI0                /* Driver SPI0 */
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
      </RTE_Components_h>
      <files>
        <file category="source"  name="RTE_Driver/DMA_EFM32GGxxx.c"/>
        <file category="source"  name="RTE_Driver/SPI_EFM32GGxxx.c"/>
      </files>
    </component>
