t21/Walnut_X/Packages/.cache/Keil.EFM32GGxxx_DFP.2.3.0.pdsc
      <component Cgroup="Touchscreen" Capiversion="1.00" condition="EFM32GG BSP Touch">
        <description>Touchscreen interface for Silicon Labs EFM32GG-DK3750 Development Kit</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32GG_DK3750/Common/Touch_DK3750.c"/>
        </files>
      </component>
      <component Cgroup="Thermometer" Capiversion="1.00" Csub="DS75" condition="EFM32GG BSP TempSensor">
        <description>Thermometer interface for DS75</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32GG_DK3750/Common/Thermometer_DS75.c"/>
        </files>
      </component>
      <component Cgroup="EEPROM" Capiversion="1.00" Csub="24AA024" condition="EFM32GG BSP EEPROM">
        <description>EEPROM interface for 24AA024</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32GG_DK3750/Common/EEPROM_24AA024.c"/>
        </files>
      </component>
    </bundle>

    <bundle Cbundle="EFM32GG-STK3700" Cclass="Board Support" Cversion="4.2.1">
      <description>Silicon Labs EFM32GG-STK3700 Development Kit</description>
      <doc>Boards/SiliconLabs/EFM32GG_STK3700/Documents/efm32gg-stk3700-ug.pdf</doc>

      <component Cgroup="CORE" condition="EFM32GG STK3700">
        <description>Silicon Labs BSP Core</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_STK3700
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__BSP.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/bsp/bsp.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_bcc.c"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_stk.c"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_stk_leds.c"/>
          <file category="header"  name="Boards/SiliconLabs/common/bsp/bsp_trace.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_trace.c"/>
          <file category="include" name="Boards/SiliconLabs/EFM32GG_STK3700/config/"/>
        </files>
      </component>

<!-- Not available on Giant Gecko DK and STK
      <component Cgroup="Drivers" Csub="CapSense" Cvariant="Standard" condition="BSP Driver CapSense">
        <description>CapSense Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_CAPSENSE
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__CapSense.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/capsense.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/capsense.c"/>
        </files>
      </component>
-->
      <component Cgroup="Drivers" Csub="CapSense" Cvariant="Low Energy" condition="BSP Driver CapSense LE">
        <description>CapSense Driver (Low Energy)</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_CAPSENSE_LE
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__CapSense.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/caplesense.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/caplesense.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Display" condition="BSP Driver Display">
        <description>Display Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_DISPLAY
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__Display.html"/>
          <file category="include" name="glib/"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/display.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/display.c"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/displaypalemlib.c"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/displayls013b7dh03.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="DmaCtrl" condition="BSP Driver DmaCtrl">
        <description>DmaCtrl Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_DMACTRL
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__DmaCtrl.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/dmactrl.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/dmactrl.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="NandFlash" condition="BSP Driver NandFlash">
        <description>NandFlash Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_NANDFLASH
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__NandFlash.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/nandflash.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/nandflash.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="RetargetIo" Cvariant="TextDisplay" condition="BSP Driver RetargetIo TextDisplay">
        <description>RetargetIo Driver (TextDisplay)</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_RETARGETIO_TEXTDISPLAY
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__RetargetIo.html"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/retargetio.c"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/retargettextdisplay.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/retargettextdisplay.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="RtcDrv" condition="BSP Driver RtcDrv">
        <description>RtcDrv Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_RTCDRV
        </RTE_Components_h>
        <files>
          <!--file category="doc"     name="emdoc/efm32gg/html/group__RtcDrv.html"/-->
          <file category="header"  name="Boards/SiliconLabs/common/drivers/rtcdrv.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/rtcdrv.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SegmentLcd" condition="BSP Driver SegmentLcd">
        <description>SegmentLcd Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_SEGMENTLCD
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__SegmentLcd.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/segmentlcd.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/segmentlcd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="TextDisplay" condition="BSP Driver TextDisplay">
        <description>TextDisplay Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_TEXTDISPLAY
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__Textdisplay.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/textdisplay.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/textdisplay.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Udelay" condition="BSP Driver Udelay">
        <description>Udelay Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_UDELAY
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__Udelay.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/udelay.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/udelay.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="VddCheck" condition="BSP Driver VddCheck">
        <description>VddCheck Driver</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_DRIVERS_VDDCHECK
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32gg/html/group__VddCheck.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/drivers/vddcheck.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/drivers/vddcheck.c"/>
        </files>
      </component>

