t21/Walnut_X/Packages/.cache/Keil.EFM32GGxxx_DFP.2.3.0.pdsc
      <component Cgroup="LED" Capiversion="1.00" condition="EFM32GG BSP">
        <description>LED interface for Silicon Labs EFM32GG-STK3700 Development Kit</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32GG_STK3700/Common/LED_STK3700.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="EFM32GG BSP">
        <description>Buttons interface for Silicon Labs EFM32GG-STK3700 Development Kit</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32GG_STK3700/Common/Buttons_STK3700.c"/>
        </files>
      </component>
    </bundle>
  </components>

  <boards>
    <board vendor="Silicon Labs" name="EFM32GG-DK3750" revision="Ver 1.0">
      <description>Silicon Labs EFM32GG-DK3750 Development Kit</description>
      <image small="Boards/SiliconLabs/EFM32GG_DK3750/Documents/efm32gg-dk3750_small.png"/>
      <book category="overview" name="https://www.silabs.com/products/mcu/lowpower/Pages/efm32gg-dk3750.aspx" title="EFM32GG-DK3750 Web Page"/>
      <book category="manual" name="Boards/SiliconLabs/EFM32GG_DK3750/Documents/efm32gg-dk3750-ug.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Silicon Labs:21" Dname="EFM32GG990F1024"/>
      <compatibleDevice deviceIndex="0" Dvendor="Silicon Labs:21" DsubFamily="EFM32GG990"/>
    </board>

    <board vendor="Silicon Labs" name="EFM32GG-STK3700" revision="Ver 1.0">
      <description>Silicon Labs EFM32GG-STK3700 Starter Kit</description>
      <image small="Boards/SiliconLabs/EFM32GG_STK3700/Documents/efm32gg-stk3700_small.png"/>
      <book category="overview" name="https://www.silabs.com/products/mcu/lowpower/Pages/efm32gg-stk3700.aspx" title="EFM32GG-STK3700 Web Page"/>
      <book category="manual"   name="Boards/SiliconLabs/EFM32GG_STK3700/Documents/efm32gg-stk3700-ug.pdf"     title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Silicon Labs:21" Dname="EFM32GG990F1024"/>
      <compatibleDevice deviceIndex="0" Dvendor="Silicon Labs:21" DsubFamily="EFM32GG990"/>
    </board>
  </boards>

  <examples>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/SiliconLabs/EFM32GG_DK3750/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="EFM32GG-DK3750" vendor="Silicon Labs"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="emWin Example" doc="Abstract.txt" folder="Boards/SiliconLabs/EFM32GG_DK3750/emWin/Example">
      <description>emWin Graphics simple example</description>
      <board name="EFM32GG-DK3750" vendor="Silicon Labs"/>
      <project>
        <environment name="uv" load="Example.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="emWin GUI Demo" doc="Abstract.txt" folder="Boards/SiliconLabs/EFM32GG_DK3750/emWin/GUIDemo">
      <description>emWin Graphics Demo example</description>
      <board name="EFM32GG-DK3750" vendor="Silicon Labs"/>
      <project>
        <environment name="uv" load="GUIDemo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>

    <example name="File System Demo" doc="Abstract.txt" folder="Boards/SiliconLabs/EFM32GG_DK3750/Middleware/FileSystem/File_Demo" version="1.0.0">
      <description>File manipulation example: create, read, copy, delete files on any enabled drive (SD/MMC Card, NOR/NAND Flash, RAM) and format each drive</description>
      <board name="EFM32GG-DK3750" vendor="Silicon Labs"/>
      <project>
        <environment name="uv" load="File_Demo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="File System" Cgroup="Drive"/>
        <category>Middleware</category>
        <category>File System</category>
        <keyword>SD/MMC Card</keyword>
      </attributes>
    </example>


    <example name="BSD Client" doc="Abstract.txt" folder="Boards/SiliconLabs/EFM32GG_DK3750/Middleware/Network/BSD_Client" version="1.0.0">
      <description>Example using BSD sockets to send commands to remote server</description>
      <board name="EFM32GG-DK3750" vendor="Silicon Labs"/>
      <project>
        <environment name="uv" load="BSD_Client.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Socket" Csub="BSD"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>BSD</keyword>
      </attributes>
    </example>

    <example name="BSD Server" doc="Abstract.txt" folder="Boards/SiliconLabs/EFM32GG_DK3750/Middleware/Network/BSD_Server" version="1.0.0">
      <description>Example using BSD sockets to accept commands from remote clients</description>
      <board name="EFM32GG-DK3750" vendor="Silicon Labs"/>
      <project>
        <environment name="uv" load="BSD_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Socket" Csub="BSD"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>BSD</keyword>
      </attributes>
    </example>

    <example name="FTP Server" doc="Abstract.txt" folder="Boards/SiliconLabs/EFM32GG_DK3750/Middleware/Network/FTP_Server" version="1.0.0">
      <description>File Server using FTP protocol with SD/MMC Memory Card as storage media</description>
      <board name="EFM32GG-DK3750" vendor="Silicon Labs"/>
      <project>
        <environment name="uv" load="FTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="FTP Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>FTP</keyword>
      </attributes>
    </example>

    <example name="HTTP Server" doc="Abstract.txt" folder="Boards/SiliconLabs/EFM32GG_DK3750/Middleware/Network/HTTP_Server" version="1.0.0">
      <description>Compact Web Server with CGI interface</description>
      <board name="EFM32GG-DK3750" vendor="Silicon Labs"/>
      <project>
        <environment name="uv" load="HTTP_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Web Server Compact"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Web Server</keyword>
        <keyword>HTTP</keyword>
      </attributes>
    </example>

